chocotov1/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# Adafruit Feather M0 (SAMD21)
# ------------------------------
adafruit_feather_m0.name=Adafruit Feather M0
adafruit_feather_m0.vid.0=0x239A
adafruit_feather_m0.pid.0=0x800B
adafruit_feather_m0.vid.1=0x239A
adafruit_feather_m0.pid.1=0x000B
adafruit_feather_m0.vid.2=0x239A
adafruit_feather_m0.pid.2=0x0015
adafruit_feather_m0.upload.tool=bossac
adafruit_feather_m0.upload.protocol=sam-ba
adafruit_feather_m0.upload.maximum_size=262144
adafruit_feather_m0.upload.offset=0x2000
adafruit_feather_m0.upload.use_1200bps_touch=true
adafruit_feather_m0.upload.wait_for_upload_port=true
adafruit_feather_m0.upload.native_usb=true
adafruit_feather_m0.build.mcu=cortex-m0plus
adafruit_feather_m0.build.f_cpu=48000000L
adafruit_feather_m0.build.usb_product="Feather M0"
adafruit_feather_m0.build.usb_manufacturer="Adafruit"
adafruit_feather_m0.build.board=SAMD_ZERO
adafruit_feather_m0.build.core=arduino
adafruit_feather_m0.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS -DADAFRUIT_FEATHER_M0 -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
adafruit_feather_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
adafruit_feather_m0.build.openocdscript=openocd_scripts/feather_m0.cfg
adafruit_feather_m0.build.variant=feather_m0
adafruit_feather_m0.build.variant_system_lib=
adafruit_feather_m0.build.vid=0x239A
adafruit_feather_m0.build.pid=0x800B
adafruit_feather_m0.bootloader.tool=openocd
adafruit_feather_m0.bootloader.file=featherM0/bootloader-feather_m0-v2.0.0-adafruit.5.bin
#adafruit_feather_m0.menu.usbstack.arduino=Arduino
#adafruit_feather_m0.menu.usbstack.tinyusb=TinyUSB
#adafruit_feather_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB
#adafruit_feather_m0.menu.debug.off=Off
#adafruit_feather_m0.menu.debug.on=On
#adafruit_feather_m0.menu.debug.on.build.flags.debug=-g

adafruit_feather_m0_no_bl.name=Adafruit Feather M0 (no bootloader)
adafruit_feather_m0_no_bl.vid.0=0x239A
adafruit_feather_m0_no_bl.pid.0=0x800B
adafruit_feather_m0_no_bl.vid.1=0x239A
adafruit_feather_m0_no_bl.pid.1=0x000B
adafruit_feather_m0_no_bl.vid.2=0x239A
adafruit_feather_m0_no_bl.pid.2=0x0015
adafruit_feather_m0_no_bl.upload.tool=bossac
adafruit_feather_m0_no_bl.upload.protocol=sam-ba
adafruit_feather_m0_no_bl.upload.maximum_size=262144
adafruit_feather_m0_no_bl.upload.offset=0x2000
adafruit_feather_m0_no_bl.upload.use_1200bps_touch=true
adafruit_feather_m0_no_bl.upload.wait_for_upload_port=true
adafruit_feather_m0_no_bl.upload.native_usb=true
adafruit_feather_m0_no_bl.build.mcu=cortex-m0plus
adafruit_feather_m0_no_bl.build.f_cpu=48000000L
adafruit_feather_m0_no_bl.build.usb_product="Feather M0"
adafruit_feather_m0_no_bl.build.usb_manufacturer="Adafruit"
adafruit_feather_m0_no_bl.build.board=SAMD_ZERO
adafruit_feather_m0_no_bl.build.core=arduino
adafruit_feather_m0_no_bl.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS -DADAFRUIT_FEATHER_M0 -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
adafruit_feather_m0_no_bl.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
adafruit_feather_m0_no_bl.build.openocdscript=openocd_scripts/feather_m0.cfg
adafruit_feather_m0_no_bl.build.variant=feather_m0
adafruit_feather_m0_no_bl.build.variant_system_lib=
adafruit_feather_m0_no_bl.build.vid=0x239A
adafruit_feather_m0_no_bl.build.pid=0x800B
adafruit_feather_m0_no_bl.bootloader.tool=openocd
adafruit_feather_m0_no_bl.bootloader.file=featherM0/bootloader-feather_m0-v2.0.0-adafruit.5.bin

adafruit_feather_m0_no_bl_24mhz.name=Adafruit Feather M0 (no bootloader, 24 MHz)
adafruit_feather_m0_no_bl_24mhz.vid.0=0x239A
adafruit_feather_m0_no_bl_24mhz.pid.0=0x800B
adafruit_feather_m0_no_bl_24mhz.vid.1=0x239A
adafruit_feather_m0_no_bl_24mhz.pid.1=0x000B
adafruit_feather_m0_no_bl_24mhz.vid.2=0x239A
adafruit_feather_m0_no_bl_24mhz.pid.2=0x0015
adafruit_feather_m0_no_bl_24mhz.upload.tool=bossac
adafruit_feather_m0_no_bl_24mhz.upload.protocol=sam-ba
adafruit_feather_m0_no_bl_24mhz.upload.maximum_size=262144
adafruit_feather_m0_no_bl_24mhz.upload.offset=0x2000
adafruit_feather_m0_no_bl_24mhz.upload.use_1200bps_touch=true
adafruit_feather_m0_no_bl_24mhz.upload.wait_for_upload_port=true
adafruit_feather_m0_no_bl_24mhz.upload.native_usb=true
adafruit_feather_m0_no_bl_24mhz.build.mcu=cortex-m0plus
adafruit_feather_m0_no_bl_24mhz.build.f_cpu=24000000L
adafruit_feather_m0_no_bl_24mhz.build.usb_product="Feather M0"
adafruit_feather_m0_no_bl_24mhz.build.usb_manufacturer="Adafruit"
adafruit_feather_m0_no_bl_24mhz.build.board=SAMD_ZERO
adafruit_feather_m0_no_bl_24mhz.build.core=arduino
adafruit_feather_m0_no_bl_24mhz.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS -DADAFRUIT_FEATHER_M0 -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
adafruit_feather_m0_no_bl_24mhz.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
adafruit_feather_m0_no_bl_24mhz.build.openocdscript=openocd_scripts/feather_m0.cfg
adafruit_feather_m0_no_bl_24mhz.build.variant=feather_m0
adafruit_feather_m0_no_bl_24mhz.build.variant_system_lib=
adafruit_feather_m0_no_bl_24mhz.build.vid=0x239A
adafruit_feather_m0_no_bl_24mhz.build.pid=0x800B
adafruit_feather_m0_no_bl_24mhz.bootloader.tool=openocd
adafruit_feather_m0_no_bl_24mhz.bootloader.file=featherM0/bootloader-feather_m0-v2.0.0-adafruit.5.bin

adafruit_feather_m0_no_bl_8mhz.name=Adafruit Feather M0 (no bootloader, 8 MHz)
adafruit_feather_m0_no_bl_8mhz.vid.0=0x239A
adafruit_feather_m0_no_bl_8mhz.pid.0=0x800B
adafruit_feather_m0_no_bl_8mhz.vid.1=0x239A
adafruit_feather_m0_no_bl_8mhz.pid.1=0x000B
adafruit_feather_m0_no_bl_8mhz.vid.2=0x239A
adafruit_feather_m0_no_bl_8mhz.pid.2=0x0015
adafruit_feather_m0_no_bl_8mhz.upload.tool=bossac
adafruit_feather_m0_no_bl_8mhz.upload.protocol=sam-ba
adafruit_feather_m0_no_bl_8mhz.upload.maximum_size=262144
adafruit_feather_m0_no_bl_8mhz.upload.offset=0x2000
adafruit_feather_m0_no_bl_8mhz.upload.use_1200bps_touch=true
adafruit_feather_m0_no_bl_8mhz.upload.wait_for_upload_port=true
adafruit_feather_m0_no_bl_8mhz.upload.native_usb=true
adafruit_feather_m0_no_bl_8mhz.build.mcu=cortex-m0plus
adafruit_feather_m0_no_bl_8mhz.build.f_cpu=8000000L
adafruit_feather_m0_no_bl_8mhz.build.usb_product="Feather M0"
adafruit_feather_m0_no_bl_8mhz.build.usb_manufacturer="Adafruit"
adafruit_feather_m0_no_bl_8mhz.build.board=SAMD_ZERO
adafruit_feather_m0_no_bl_8mhz.build.core=arduino
adafruit_feather_m0_no_bl_8mhz.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS -DADAFRUIT_FEATHER_M0 -D__SAMD21G18A__ {build.usb_flags}
adafruit_feather_m0_no_bl_8mhz.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
adafruit_feather_m0_no_bl_8mhz.build.openocdscript=openocd_scripts/feather_m0.cfg
adafruit_feather_m0_no_bl_8mhz.build.variant=feather_m0
adafruit_feather_m0_no_bl_8mhz.build.variant_system_lib=
adafruit_feather_m0_no_bl_8mhz.build.vid=0x239A
adafruit_feather_m0_no_bl_8mhz.build.pid=0x800B
adafruit_feather_m0_no_bl_8mhz.bootloader.tool=openocd
adafruit_feather_m0_no_bl_8mhz.bootloader.file=featherM0/bootloader-feather_m0-v2.0.0-adafruit.5.bin

