chocotov1/ArduinoCore-samd/boards.txt
samd21_proRF.name=SparkFun SAMD21 Pro RF
samd21_proRF.vid.0=0x1B4F
samd21_proRF.pid.0=0x214F
samd21_proRF.vid.1=0x1B4F
samd21_proRF.pid.1=0x215F
samd21_proRF.upload.tool=bossac
samd21_proRF.upload.protocol=sam-ba
samd21_proRF.upload.maximum_size=262144
samd21_proRF.upload.use_1200bps_touch=true
samd21_proRF.upload.wait_for_upload_port=true
samd21_proRF.upload.native_usb=true
samd21_proRF.build.mcu=cortex-m0plus
samd21_proRF.build.f_cpu=48000000L
samd21_proRF.build.usb_product="SFE SAMD21 Pro RF"
samd21_proRF.build.usb_manufacturer="SparkFun"
samd21_proRF.build.board=SAMD_ZERO
samd21_proRF.build.core=arduino
samd21_proRF.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
samd21_proRF.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
samd21_proRF.build.openocdscript=openocd_scripts/arduino_zero.cfg
samd21_proRF.build.variant=SparkFun_ProRF
samd21_proRF.build.variant_system_lib=
samd21_proRF.build.extra_combine_flags=
samd21_proRF.build.vid=0x1B4F
samd21_proRF.build.pid=0x214F
samd21_proRF.bootloader.tool=openocd
samd21_proRF.bootloader.file=zero/Sparkfun_SAMD21_ProRF.bin

samd21_proRF_no_bl_24.name=SparkFun SAMD21 Pro RF (no bootloader, 24 MHz)
samd21_proRF_no_bl_24.vid.0=0x1B4F
samd21_proRF_no_bl_24.pid.0=0x214F
samd21_proRF_no_bl_24.vid.1=0x1B4F
samd21_proRF_no_bl_24.pid.1=0x215F
samd21_proRF_no_bl_24.upload.tool=bossac
samd21_proRF_no_bl_24.upload.protocol=sam-ba
samd21_proRF_no_bl_24.upload.maximum_size=262144
samd21_proRF_no_bl_24.upload.use_1200bps_touch=true
samd21_proRF_no_bl_24.upload.wait_for_upload_port=true
samd21_proRF_no_bl_24.upload.native_usb=true
samd21_proRF_no_bl_24.build.mcu=cortex-m0plus
samd21_proRF_no_bl_24.build.f_cpu=24000000L
samd21_proRF_no_bl_24.build.usb_product="SFE SAMD21 Pro RF"
samd21_proRF_no_bl_24.build.usb_manufacturer="SparkFun"
samd21_proRF_no_bl_24.build.board=SAMD_ZERO
samd21_proRF_no_bl_24.build.core=arduino
samd21_proRF_no_bl_24.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
samd21_proRF_no_bl_24.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
samd21_proRF_no_bl_24.build.openocdscript=openocd_scripts/arduino_zero.cfg
samd21_proRF_no_bl_24.build.variant=SparkFun_ProRF
samd21_proRF_no_bl_24.build.variant_system_lib=
samd21_proRF_no_bl_24.build.extra_combine_flags=
samd21_proRF_no_bl_24.build.vid=0x1B4F
samd21_proRF_no_bl_24.build.pid=0x214F
samd21_proRF_no_bl_24.bootloader.tool=openocd
samd21_proRF_no_bl_24.bootloader.file=zero/Sparkfun_SAMD21_ProRF.bin

samd21_proRF_no_bl.name=SparkFun SAMD21 Pro RF (no bootloader, 8 MHz)
samd21_proRF_no_bl.vid.0=0x1B4F
samd21_proRF_no_bl.pid.0=0x214F
samd21_proRF_no_bl.vid.1=0x1B4F
samd21_proRF_no_bl.pid.1=0x215F
samd21_proRF_no_bl.upload.tool=bossac
samd21_proRF_no_bl.upload.protocol=sam-ba
samd21_proRF_no_bl.upload.maximum_size=262144
samd21_proRF_no_bl.upload.use_1200bps_touch=true
samd21_proRF_no_bl.upload.wait_for_upload_port=true
samd21_proRF_no_bl.upload.native_usb=true
samd21_proRF_no_bl.build.mcu=cortex-m0plus
samd21_proRF_no_bl.build.f_cpu=8000000L
samd21_proRF_no_bl.build.usb_product="SFE SAMD21 Pro RF"
samd21_proRF_no_bl.build.usb_manufacturer="SparkFun"
samd21_proRF_no_bl.build.board=SAMD_ZERO
samd21_proRF_no_bl.build.core=arduino
samd21_proRF_no_bl.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
samd21_proRF_no_bl.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
samd21_proRF_no_bl.build.openocdscript=openocd_scripts/arduino_zero.cfg
samd21_proRF_no_bl.build.variant=SparkFun_ProRF
samd21_proRF_no_bl.build.variant_system_lib=
samd21_proRF_no_bl.build.extra_combine_flags=
samd21_proRF_no_bl.build.vid=0x1B4F
samd21_proRF_no_bl.build.pid=0x214F
samd21_proRF_no_bl.bootloader.tool=openocd
samd21_proRF_no_bl.bootloader.file=zero/Sparkfun_SAMD21_ProRF.bin

# Arduino Zero (Prorgamming Port)
# ---------------------------------------
arduino_zero_edbg.name=Arduino Zero (Programming Port)
arduino_zero_edbg.vid.0=0x03eb
arduino_zero_edbg.pid.0=0x2157

arduino_zero_edbg.debug.tool=gdb-openocd
arduino_zero_edbg.upload.tool=openocd
arduino_zero_edbg.upload.protocol=sam-ba
arduino_zero_edbg.upload.maximum_size=262144
arduino_zero_edbg.upload.maximum_data_size=32768
arduino_zero_edbg.upload.use_1200bps_touch=false
arduino_zero_edbg.upload.wait_for_upload_port=false
arduino_zero_edbg.upload.native_usb=false
arduino_zero_edbg.build.mcu=cortex-m0plus
arduino_zero_edbg.build.f_cpu=48000000L
arduino_zero_edbg.build.usb_product="Arduino Zero"
arduino_zero_edbg.build.usb_manufacturer="Arduino LLC"
arduino_zero_edbg.build.board=SAMD_ZERO
arduino_zero_edbg.build.core=arduino
arduino_zero_edbg.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
arduino_zero_edbg.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_edbg.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_edbg.build.variant=arduino_zero
arduino_zero_edbg.build.variant_system_lib=
arduino_zero_edbg.build.vid=0x2341
arduino_zero_edbg.build.pid=0x804d
arduino_zero_edbg.bootloader.tool=openocd
arduino_zero_edbg.bootloader.file=zero/samd21_sam_ba.bin

# Arduino Zero (Native USB Port)
# --------------------------------------
arduino_zero_native.name=Arduino Zero (Native USB Port)
arduino_zero_native.vid.0=0x2341
arduino_zero_native.pid.0=0x804d
arduino_zero_native.vid.1=0x2341
arduino_zero_native.pid.1=0x004d
arduino_zero_native.vid.2=0x2341
arduino_zero_native.pid.2=0x824d
arduino_zero_native.vid.3=0x2341
arduino_zero_native.pid.3=0x024d

arduino_zero_native.upload.tool=bossac
arduino_zero_native.upload.protocol=sam-ba
arduino_zero_native.upload.maximum_size=262144
arduino_zero_native.upload.maximum_data_size=32768
arduino_zero_native.upload.use_1200bps_touch=true
arduino_zero_native.upload.wait_for_upload_port=true
arduino_zero_native.upload.native_usb=true
arduino_zero_native.build.mcu=cortex-m0plus
arduino_zero_native.build.f_cpu=48000000L
arduino_zero_native.build.usb_product="Arduino Zero"
arduino_zero_native.build.usb_manufacturer="Arduino LLC"
arduino_zero_native.build.board=SAMD_ZERO
arduino_zero_native.build.core=arduino
arduino_zero_native.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
arduino_zero_native.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
arduino_zero_native.build.openocdscript=openocd_scripts/arduino_zero.cfg
arduino_zero_native.build.variant=arduino_zero
arduino_zero_native.build.variant_system_lib=
arduino_zero_native.build.vid=0x2341
arduino_zero_native.build.pid=0x804d
arduino_zero_native.bootloader.tool=openocd
arduino_zero_native.bootloader.file=zero/samd21_sam_ba.bin

