chocotov1/ArduinoCore-samd/boards.txt
# Arduino MKR1000
# -----------------------
mkr1000.name=Arduino MKR1000
mkr1000.vid.0=0x2341
mkr1000.pid.0=0x804e
mkr1000.vid.1=0x2341
mkr1000.pid.1=0x004e
mkr1000.vid.2=0x2341
mkr1000.pid.2=0x824e
mkr1000.vid.3=0x2341
mkr1000.pid.3=0x024e

mkr1000.debug.tool=gdb-openocd
mkr1000.upload.tool=bossac
mkr1000.upload.protocol=sam-ba
mkr1000.upload.maximum_size=262144
mkr1000.upload.maximum_data_size=32768
mkr1000.upload.use_1200bps_touch=true
mkr1000.upload.wait_for_upload_port=true
mkr1000.upload.native_usb=true
mkr1000.build.mcu=cortex-m0plus
mkr1000.build.f_cpu=48000000L
mkr1000.build.usb_product="Arduino MKR1000"
mkr1000.build.usb_manufacturer="Arduino LLC"
mkr1000.build.board=SAMD_MKR1000
mkr1000.build.core=arduino
mkr1000.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags}
mkr1000.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkr1000.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkr1000.build.variant=mkr1000
mkr1000.build.vid=0x2341
mkr1000.build.pid=0x804e
mkr1000.bootloader.tool=openocd
mkr1000.bootloader.file=mkr1000/samd21_sam_ba_arduino_mkr1000.bin

# Arduino MKRZero
# ---------------
mkrzero.name=Arduino MKRZERO
mkrzero.vid.0=0x2341
mkrzero.pid.0=0x804f
mkrzero.vid.1=0x2341
mkrzero.pid.1=0x004f

mkrzero.debug.tool=gdb-openocd
mkrzero.upload.tool=bossac
mkrzero.upload.protocol=sam-ba
mkrzero.upload.maximum_size=262144
mkrzero.upload.maximum_data_size=32768
mkrzero.upload.use_1200bps_touch=true
mkrzero.upload.wait_for_upload_port=true
mkrzero.upload.native_usb=true
mkrzero.build.mcu=cortex-m0plus
mkrzero.build.f_cpu=48000000L
mkrzero.build.usb_product="Arduino MKRZero"
mkrzero.build.usb_manufacturer="Arduino LLC"
mkrzero.build.board=SAMD_MKRZERO
mkrzero.build.core=arduino
mkrzero.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
mkrzero.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrzero.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrzero.build.variant=mkrzero
mkrzero.build.vid=0x2341
mkrzero.build.pid=0x804f
mkrzero.bootloader.tool=openocd
mkrzero.bootloader.file=mkrzero/samd21_sam_ba_arduino_mkrzero.bin

mkrzero_no_bl.name=Arduino MKRZERO (no bootloader)
mkrzero_no_bl.vid.0=0x2341
mkrzero_no_bl.pid.0=0x804f
mkrzero_no_bl.vid.1=0x2341
mkrzero_no_bl.pid.1=0x004f

mkrzero_no_bl.debug.tool=gdb-openocd
mkrzero_no_bl.upload.tool=bossac
mkrzero_no_bl.upload.protocol=sam-ba
mkrzero_no_bl.upload.maximum_size=262144
mkrzero_no_bl.upload.maximum_data_size=32768
mkrzero_no_bl.upload.use_1200bps_touch=true
mkrzero_no_bl.upload.wait_for_upload_port=true
mkrzero_no_bl.upload.native_usb=true
mkrzero_no_bl.build.mcu=cortex-m0plus
mkrzero_no_bl.build.f_cpu=48000000L
mkrzero_no_bl.build.usb_product="Arduino MKRZero"
mkrzero_no_bl.build.usb_manufacturer="Arduino LLC"
mkrzero_no_bl.build.board=SAMD_MKRZERO
mkrzero_no_bl.build.core=arduino
mkrzero_no_bl.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
mkrzero_no_bl.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
mkrzero_no_bl.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrzero_no_bl.build.variant=mkrzero
mkrzero_no_bl.build.vid=0x2341
mkrzero_no_bl.build.pid=0x804f
mkrzero_no_bl.bootloader.tool=openocd
mkrzero_no_bl.bootloader.file=mkrzero/samd21_sam_ba_arduino_mkrzero.bin

mkrzero_no_bl_24mhz.name=Arduino MKRZERO (no bootloader, 24 MHz)
mkrzero_no_bl_24mhz.vid.0=0x2341
mkrzero_no_bl_24mhz.pid.0=0x804f
mkrzero_no_bl_24mhz.vid.1=0x2341
mkrzero_no_bl_24mhz.pid.1=0x004f

mkrzero_no_bl_24mhz.debug.tool=gdb-openocd
mkrzero_no_bl_24mhz.upload.tool=bossac
mkrzero_no_bl_24mhz.upload.protocol=sam-ba
mkrzero_no_bl_24mhz.upload.maximum_size=262144
mkrzero_no_bl_24mhz.upload.maximum_data_size=32768
mkrzero_no_bl_24mhz.upload.use_1200bps_touch=true
mkrzero_no_bl_24mhz.upload.wait_for_upload_port=true
mkrzero_no_bl_24mhz.upload.native_usb=true
mkrzero_no_bl_24mhz.build.mcu=cortex-m0plus
mkrzero_no_bl_24mhz.build.f_cpu=24000000L
mkrzero_no_bl_24mhz.build.usb_product="Arduino MKRZero"
mkrzero_no_bl_24mhz.build.usb_manufacturer="Arduino LLC"
mkrzero_no_bl_24mhz.build.board=SAMD_MKRZERO
mkrzero_no_bl_24mhz.build.core=arduino
mkrzero_no_bl_24mhz.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
mkrzero_no_bl_24mhz.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
mkrzero_no_bl_24mhz.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrzero_no_bl_24mhz.build.variant=mkrzero
mkrzero_no_bl_24mhz.build.vid=0x2341
mkrzero_no_bl_24mhz.build.pid=0x804f
mkrzero_no_bl_24mhz.bootloader.tool=openocd
mkrzero_no_bl_24mhz.bootloader.file=mkrzero/samd21_sam_ba_arduino_mkrzero.bin

mkrzero_no_bl_8mhz.name=Arduino MKRZERO (no bootloader, 8 MHz)
mkrzero_no_bl_8mhz.vid.0=0x2341
mkrzero_no_bl_8mhz.pid.0=0x804f
mkrzero_no_bl_8mhz.vid.1=0x2341
mkrzero_no_bl_8mhz.pid.1=0x004f

mkrzero_no_bl_8mhz.debug.tool=gdb-openocd
mkrzero_no_bl_8mhz.upload.tool=bossac
mkrzero_no_bl_8mhz.upload.protocol=sam-ba
mkrzero_no_bl_8mhz.upload.maximum_size=262144
mkrzero_no_bl_8mhz.upload.maximum_data_size=32768
mkrzero_no_bl_8mhz.upload.use_1200bps_touch=true
mkrzero_no_bl_8mhz.upload.wait_for_upload_port=true
mkrzero_no_bl_8mhz.upload.native_usb=true
mkrzero_no_bl_8mhz.build.mcu=cortex-m0plus
mkrzero_no_bl_8mhz.build.f_cpu=8000000L
mkrzero_no_bl_8mhz.build.usb_product="Arduino MKRZero"
mkrzero_no_bl_8mhz.build.usb_manufacturer="Arduino LLC"
mkrzero_no_bl_8mhz.build.board=SAMD_MKRZERO
mkrzero_no_bl_8mhz.build.core=arduino
mkrzero_no_bl_8mhz.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DVERY_LOW_POWER
mkrzero_no_bl_8mhz.build.ldscript=linker_scripts/gcc/flash_without_bootloader.ld
mkrzero_no_bl_8mhz.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrzero_no_bl_8mhz.build.variant=mkrzero
mkrzero_no_bl_8mhz.build.vid=0x2341
mkrzero_no_bl_8mhz.build.pid=0x804f
mkrzero_no_bl_8mhz.bootloader.tool=openocd
mkrzero_no_bl_8mhz.bootloader.file=mkrzero/samd21_sam_ba_arduino_mkrzero.bin

# Arduino MKR WiFi 1010
# --------------------
mkrwifi1010.name=Arduino MKR WiFi 1010
mkrwifi1010.vid.0=0x2341
mkrwifi1010.pid.0=0x8054
mkrwifi1010.vid.1=0x2341
mkrwifi1010.pid.1=0x0054

mkrwifi1010.debug.tool=gdb-openocd
mkrwifi1010.upload.tool=bossac
mkrwifi1010.upload.protocol=sam-ba
mkrwifi1010.upload.maximum_size=262144
mkrwifi1010.upload.maximum_data_size=32768
mkrwifi1010.upload.use_1200bps_touch=true
mkrwifi1010.upload.wait_for_upload_port=true
mkrwifi1010.upload.native_usb=true
mkrwifi1010.build.mcu=cortex-m0plus
mkrwifi1010.build.f_cpu=48000000L
mkrwifi1010.build.usb_product="Arduino MKR WiFi 1010"
mkrwifi1010.build.usb_manufacturer="Arduino LLC"
mkrwifi1010.build.board=SAMD_MKRWIFI1010
mkrwifi1010.build.core=arduino
mkrwifi1010.build.extra_flags=-DUSE_ARDUINO_MKR_PIN_LAYOUT -D__SAMD21G18A__ {build.usb_flags} -DUSE_BQ24195L_PMIC
mkrwifi1010.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
mkrwifi1010.build.openocdscript=openocd_scripts/arduino_zero.cfg
mkrwifi1010.build.variant=mkrwifi1010
mkrwifi1010.build.vid=0x2341
mkrwifi1010.build.pid=0x8054
mkrwifi1010.bootloader.tool=openocd
mkrwifi1010.bootloader.file=mkrwifi1010/samd21_sam_ba_arduino_mkrwifi1010.bin
mkrwifi1010.arduinoota.extraflags=-d

# Arduino NANO 33 IoT
# --------------------
nano_33_iot.name=Arduino NANO 33 IoT
nano_33_iot.vid.0=0x2341
nano_33_iot.pid.0=0x8057
nano_33_iot.vid.1=0x2341
nano_33_iot.pid.1=0x0057

